DataProcessors/ОбменЧерезФайлыTXT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменЧерезФайлыTXT</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбменЧерезФайлыTXT/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Вариант 1: ОБЪЕКТ "ТЕКСТОВЫЙ ДОКУМЕНТ"

&НаСервере
Процедура ТекстовыйДокумент_Выгрузить()
	
	Разделитель = "✿";

	ТекстДок = Новый ТекстовыйДокумент;
	
	Выборка = Справочники.ФизическиеЛица.Выбрать( , , , "Наименование");
	// Сортировка по алфавиту
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаФЛ = Выборка.Наименование + Разделитель 
		+ Выборка.Код + Разделитель
		+ Выборка.Пол + Разделитель
		+ Выборка.ИНН + Разделитель
		+ Формат(Выборка.ДатаРождения, "ДФ = 'dd.MM.yyyy'");
				
		ТекстДок.ДобавитьСтроку(СтрокаФЛ);
		
	КонецЦикла;
	
	ТекстДок.Записать(ТекущийКаталог + "Список физических лиц (вариант 1).txt");
	// UTF-8
	
	Сообщения.ДобавитьСтроку("Выгрузка данных завершена, перейдите в текущий каталог!");	
	
КонецПроцедуры

&НаСервере
Процедура ТекстовыйДокумент_Прочитать()
	
	Разделитель = "✿";
	
	ТекстДок = Новый ТекстовыйДокумент;
	
	ТекстДок.Прочитать(ТекущийКаталог + "Список физических лиц (вариант 1).txt");
	
	Для НомерСтроки = 1 По ТекстДок.КоличествоСтрок() Цикл
		
		СтрокаФЛ = ТекстДок.ПолучитьСтроку(НомерСтроки);
		
		СтрокаФЛ = 
		СтрЗаменить(СтрокаФЛ, Разделитель, Символы.ПС);
		
		ФИО = СтрПолучитьСтроку(СтрокаФЛ, 1);
		Код = СтрПолучитьСтроку(СтрокаФЛ, 2);
		Пол = СтрПолучитьСтроку(СтрокаФЛ, 3);
		ИНН = СтрПолучитьСтроку(СтрокаФЛ, 4);
		ДР  = СтрПолучитьСтроку(СтрокаФЛ, 5);
		
		Сообщения.ДобавитьСтроку("Фамилия, имя, отчество: " + ФИО + "
		|Код: " + Код + "
		|Пол: " + Пол + "
		|ИНН: " + ИНН + "
		|Дата рождения: " + ДР + Символы.ПС);
		
	КонецЦикла;			
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// Вариант 2: ПОСЛЕДОВАТЕЛЬНЫЙ ДОСТУП

&НаСервере
Процедура ПоследовательныйДоступ_Выгрузить()
	
	Разделитель = "✿";
	
	// Открываем соединение с файлом
	ПоследовательнаяЗапись =
	Новый ЗаписьТекста(ТекущийКаталог + "Список физических лиц (вариант 2).txt");
	// UTF-8
	
	Выборка = Справочники.ФизическиеЛица.Выбрать( , , , "Наименование");
	// Сортировка по алфавиту
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаФЛ = Выборка.Наименование + Разделитель 
		+ Выборка.Код + Разделитель
		+ Выборка.Пол + Разделитель
		+ Выборка.ИНН + Разделитель
		+ Формат(Выборка.ДатаРождения, "ДФ = 'dd.MM.yyyy'");
		
		ПоследовательнаяЗапись.ЗаписатьСтроку(СтрокаФЛ);
		
	КонецЦикла;
	
	// Закрываем соединение
	ПоследовательнаяЗапись.Закрыть();
	
	Сообщения.ДобавитьСтроку("Выгрузка данных завершена, перейдите в текущий каталог!");	
	
КонецПроцедуры

&НаСервере
Процедура ПоследовательныйДоступ_Прочитать()
	
	Разделитель = "✿";
	
	// Открываем соединение с файлом
	ПоследовательноеЧтение =
	Новый ЧтениеТекста(ТекущийКаталог + "Список физических лиц (вариант 2).txt");
	
	СтрокаФЛ = ПоследовательноеЧтение.ПрочитатьСтроку();
	
	Пока СтрокаФЛ <> Неопределено Цикл
		
		СтрокаФЛ = 
		СтрЗаменить(СтрокаФЛ, Разделитель, Символы.ПС);
		
		ФИО = СтрПолучитьСтроку(СтрокаФЛ, 1);
		Код = СтрПолучитьСтроку(СтрокаФЛ, 2);
		Пол = СтрПолучитьСтроку(СтрокаФЛ, 3);
		ИНН = СтрПолучитьСтроку(СтрокаФЛ, 4);
		ДР  = СтрПолучитьСтроку(СтрокаФЛ, 5);
		
		Сообщения.ДобавитьСтроку("Фамилия, имя, отчество: " + ФИО + "
		|Код: " + Код + "
		|Пол: " + Пол + "
		|ИНН: " + ИНН + "
		|Дата рождения: " + ДР + Символы.ПС);
		
		СтрокаФЛ = ПоследовательноеЧтение.ПрочитатьСтроку();
		
	КонецЦикла;	
	
	// Закрываем соединение с файлом
	ПоследовательноеЧтение.Закрыть();	
	
КонецПроцедуры


#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 1\Обмен через txt-файлы\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_ТекстовыйДокумент_Выгрузить(Команда)
	
	Сообщения.Очистить();
	ТекстовыйДокумент_Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ТекстовыйДокумент_Прочитать(Команда)
	
	Сообщения.Очистить();
	ТекстовыйДокумент_Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ПоследовательныйДоступ_Выгрузить(Команда)
	
	Сообщения.Очистить();
	ПоследовательныйДоступ_Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ПоследовательныйДоступ_Прочитать(Команда)
	
	Сообщения.Очистить();
	ПоследовательныйДоступ_Прочитать();
	
КонецПроцедуры

#КонецОбласти
